Program lab2_5;
var x,y,z:String;
s1,s2,s3:Char;
begin
z:='';
Write('(100-999):');
ReadLn(s1,s2,s3);
case s1 of
'1':x:='сто';
'2':x:='двести';
'3':x:='триста';
'4':x:='четыреста';
'5':x:='пятьсот';
'6':x:='шестьсот';
'7':x:='семьсот';
'8':x:='восемьсот';
'9':x:='девятьсот';
end;
if s2='1' then 
  begin
  if (s2+s3)='10' then
    y:='десять';
  if (s2+s3)='11' then
    y:='одиннадцать';
  if (s2+s3)='12' then
    y:='двенадцать';
  if (s2+s3)='13' then
    y:='тринадцать';
  if (s2+s3)='14' then
    y:='четырнадцать';
  if (s2+s3)='15'then
    y:='пятнадцать';
  if (s2+s3)='16' then
    y:='шестнадцать';
  if (s2+s3)='17' then
    y:='семнадцать';
  if (s2+s3)='18' then
    y:='восемнадцать';
  if (s2+s3)='19' then
    y:='девятнадцать';
  end
 else
  case s2 of
  '2':y:='двадцать';
  '3':y:='тридцать';
  '4':y:='сорок';
  '5':y:='пятьдесят';
  '6':y:='шестьдесят';
  '7':y:='семьдесят';
  '8':y:='восемьдесят';
  '9':y:='девяносто';
  end;
  if  s2<>'1' then
  begin
  case s3 of
  '1':z:='один';
  '2':z:='два';
  '3':z:='три';
  '4':z:='четыре';
  '5':z:='пять';
  '6':z:='шесть';
  '7':z:='семь';
  '8':z:='восемь';
  '9':z:='девять';
  end;
  end;
writeLn(s1,s2,s3, ':',x+' '+y+' '+z+ ';');
end.